# Имена детей в США

https://www.kaggle.com/kaggle/us-baby-names
либо забираем датасет из папки datasets/US_Baby_Names_right.csv

### Шаг 1. Импортируем библиотеки.

In [2]:
import pandas as pd

### Шаг 2 Записываем его в переменную baby_names

In [3]:
baby_names=pd.read_csv('/home/ambr2000/Downloads/NationalNames.csv')

### Шаг 3. Смотрим первые 10 записей

In [4]:
baby_names.head(10)
# хочу обратить внимание, что мой массив данных был загружен из интернета 
# и возможно он отличается от массива в datasets

   Id       Name  Year Gender  Count
0   1       Mary  1880      F   7065
1   2       Anna  1880      F   2604
2   3       Emma  1880      F   2003
3   4  Elizabeth  1880      F   1939
4   5     Minnie  1880      F   1746
5   6   Margaret  1880      F   1578
6   7        Ida  1880      F   1472
7   8      Alice  1880      F   1414
8   9     Bertha  1880      F   1320
9  10      Sarah  1880      F   1288

### Шаг 4. Удаляем колонки 'Unnamed: 0' и 'Id'

In [5]:
baby_names.drop('Id',axis=1,inplace=True)
baby_names.head(10)

        Name  Year Gender  Count
0       Mary  1880      F   7065
1       Anna  1880      F   2604
2       Emma  1880      F   2003
3  Elizabeth  1880      F   1939
4     Minnie  1880      F   1746
5   Margaret  1880      F   1578
6        Ida  1880      F   1472
7      Alice  1880      F   1414
8     Bertha  1880      F   1320
9      Sarah  1880      F   1288

### Шаг 5. В датасете больше мужских или женских имен?

In [6]:
baby_names['Gender'].value_counts()
# женских имен больше

F    1081683
M     743750
Name: Gender, dtype: int64

### Шаг 6. Посчитайте, сколько раз встречалось каждое имя и запишите получившийся датафрейм в переменную names

In [7]:
names = baby_names.groupby('Name')['Count'].sum().reset_index()
names

            Name  Count
0          Aaban     72
1          Aabha     21
2          Aabid      5
3      Aabriella     10
4          Aadam    196
...          ...    ...
93884  Zytavious     43
93885     Zyvion      5
93886    Zyyanna      6
93887      Zyyon      6
93888      Zzyzx      5

[93889 rows x 2 columns]

### Шаг 7. Сколько разных имен в датасете?

In [8]:
baby_names['Name'].nunique()

93889

### Шаг 8. Какое самое частое имя?

In [9]:
baby_names.groupby('Name')['Count'].sum().idxmax()

'James'

### Шаг 9. Сколько разных имен встречаются реже всего?

In [60]:
less_freq=names[names['Count']==1].count()
print (less_freq)

Count    20332
dtype: int64

### Шаг 10. Какое медианное значение количества детей с одинаковым именем?

In [65]:
median=names[names['Count']>1].median()
print (median)

Count    11.0
dtype: float64

### Шаг 11. Какое среднеквадратичное отклонение количества детей с одинаковым именем?

In [67]:
std=names[names['Count']>1].std()
print (std)

Count    34.869339
dtype: float64

### Шаг 12. Сделайте саммари с mean, min, max, std и квартилями.

In [68]:
names.describe()

              Count
count  93889.000000
mean      19.442459
std       32.350921
min        1.000000
25%        2.000000
50%        7.000000
75%       22.000000
max      270.000000